class Program
{    
    // 메인 루프 :

    // 초기화

    // 업데이트
    //무한루프
    // input
    //로직
    // 랜더링

    // 유니티도 이와 동일

    // 게임 프레임: 무한루프를 1초에 몇번 도냐 > 1초동안 몇번 아래 행동을 반복
    // 1초에 60번 돌면 : 60프레임
    // 1초에 200번 돌면 : 200프레임

    // 프레임 드랍 : 점점 도는 것이 느려지는 것

    // 클래스
    // 가위바위보게임
    // Main함수도 Stack에 올린다
    // 런 타임 : 실행중에
    // 컴파일 타임 : 빌드되는 중에

    // 커널공간 - 운영체제
    // 커널공간이 RAM에 지시 > 명령
    // 운영체제를 통해서 프로그램을 실행할 공간이 잡힌다
    // 사용자 공간 : 코드 > 데이터 > 힙(프로그램이 실행되는 과정에서 계속 늘어남) > 스택(일정부분 크기가 정해져있음)
    //          낮은<------------------------------------------------------------------------------->높은
    // 크기는 고정되어있고, 사용이 끝나면 사라진다
    // 스택오버플로우 : 스택의 영역을 초과했다. > 스택은 늘어나지 않는다
    // 참조 전달 / 값 전달
    // ref
    static void Test(int a) // a는 값이 필요해요
    {
        a++;/*a의 값인 99라는 값을 연산하시오*/
    }

    static void Add(ref int a) //ref a는 주소값이 필요해요
    {
        a++; /*0xfff999s의 주소 속 값을 가지고 연산하시오 */
    }

    // 값형식 - 대부분의 기본 형식
    // 참조형식 - 클래스 배열 등....
    // 이 두형식을 사용하여 함수의 인자로 사용할 시 차이점이 있다
    // 값 형식 > 값 전달(값 복사 - 짝퉁 , 사본)
    // 참조 형식 > 참조 전달(주소 공유 - 진퉁 , 진본)
    // ref가 붙게 되면 값 형식 조차도 값 전달로 바뀌게 된다
    // 왠만하면 값 전달로 하길바람.
    // 정 필요하면 주소값 전달하더라도...

    static void Swap(ref int a , ref int b) 
    {
        // 임시 저장소가 필요 
        int temp = a;
        a = b;
        b = temp;
    }
    static void Swop(int a, int b)
    {
        // 임시 저장소가 필요 
        int temp = a;
        a = b;
        b = temp;
    }
    static void Main() // 아 여기서부터 시작되는구나...
        {
        //int a = 10;// a는 10이다
         int a/*0xfff999s*/ = 99; //a는 99이다

            Test(a/*a의 값인 99라는 값*/);// 그냥 10이라는 값만 준 것 > 끝나면 사라지는 값

            Console.WriteLine(a/*a의 값 자체*/);// 이거 10일까 11일까? > 10이 나온다
                                              // 이거 99일까 100일까 > 99이다

            Add(ref a/*0xfff999s*/);// 이건 a의 주소값을 준 것 > a속 값을 바꾼다

             Console.WriteLine(a/*a의 값*/);// 이거 10일까 11일까? > 11이 나온다
                                           // 이거 99일까 100일까 > 100이다

        //x와 y의 값을 서로 바꿔라
        int x = 10;
        int y = 20;
        Swap(ref x , ref y );
        Console.WriteLine($"{x},{y}");

        //ref  








    }

}

